<a href="https://colab.research.google.com/github/kdstheace/Python-Study/blob/main/PandasReview.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import numpy as np
import pandas as pd
print(np.__version__)
print(pd.__version__)

1.19.5
1.1.5

In [ ]:
#Series 생성하기
s = pd.Series([1, 2, 3, 4, 4.5, np.nan, 7, 8])
print(s)
list_data = [11, 12, 13, 14, 15]
list_name = ['Z', 'Y', 'C', 'D', 'E']

s2 = pd.Series(data=list_data, index=list_name)
print(s2)

dic_data = {'A':12, 'B':31, 'C':91, 'D':27}
s3 = pd.Series(dic_data, dtype=np.float64, name='Score')
print(s3)

In [21]:
#데이터 참조하기
print(s3['A'])
s3['B'] = 55
print(s3)

#index 와 value 꺼내기
print(s3.values)
print(s3.index)
print(s3[s3 >= 55])

#브로드캐스팅
print(s3*1.5)

12.0
A    12.0
B    55.0
C    91.0
D    27.0
Name: Score, dtype: float64
[12. 55. 91. 27.]
Index(['A', 'B', 'C', 'D'], dtype='object')
B    55.0
C    91.0
Name: Score, dtype: float64
A     18.0
B     82.5
C    136.5
D     40.5
Name: Score, dtype: float64

# **Pandas DataFrame**

In [7]:
from pandas import Series, DataFrame
import numpy as np
import pandas as pd

In [8]:
raw_data = {
    '이름' : ['홍길동', '전우치', '손오공', '사오정', '저팔계'],
    '나이' : [32, 37, 30, 31, 33],
    '전화번호' : ['010-1111-2222', '010-231-2222','010-8111-2522','010-1471-2222', '010-3456-3785'],
    '지역' : ['서울','대구','용인','제주','속초']
}
df = DataFrame(raw_data, columns=['이름','나이','전화번호','지역'])
df1 = DataFrame(raw_data, columns=['이름','나이','전화번호','성별'], index=['A','B','C','D','E'])
df1

    이름  나이           전화번호   성별
A  홍길동  32  010-1111-2222  NaN
B  전우치  37   010-231-2222  NaN
C  손오공  30  010-8111-2522  NaN
D  사오정  31  010-1471-2222  NaN
E  저팔계  33  010-3456-3785  NaN

In [38]:
df1['성별']

A    NaN
B    NaN
C    NaN
D    NaN
E    NaN
Name: 성별, dtype: object

In [48]:
#iloc, loc
print(df1.loc['A'])
print(df1.iloc[4])

이름                홍길동
나이                 32
전화번호    010-1111-2222
성별                NaN
Name: A, dtype: object
이름                저팔계
나이                 33
전화번호    010-3456-3785
성별                NaN
Name: E, dtype: object

In [51]:
tmp = Series(np.nan, index=[45, 46, 99, 48, 1, 2, 3, 4, 5])
tmp.iloc[:4]

45   NaN
46   NaN
99   NaN
48   NaN
dtype: float64

In [9]:
#iloc로 손오공 꺼내기.
#loc로 전우치 꺼내기
df1.iloc[2]
df1.loc['B']

이름               전우치
나이                37
전화번호    010-231-2222
성별               NaN
Name: B, dtype: object

In [6]:
df1['특징'] = df1['나이'] > 30
df1

NameError: ignored

In [11]:
s = Series(data=['남','여','남'], index = ['A', 'B', 'E'])
df1['성별'] = s
df1

    이름  나이           전화번호   성별
A  홍길동  32  010-1111-2222    남
B  전우치  37   010-231-2222    여
C  손오공  30  010-8111-2522  NaN
D  사오정  31  010-1471-2222  NaN
E  저팔계  33  010-3456-3785    남

In [15]:
df1['성별'].fillna('누락')

A     남
B     여
C    누락
D    누락
E     남
Name: 성별, dtype: object

In [16]:
df1['성별'].isnull()

A    False
B    False
C     True
D     True
E    False
Name: 성별, dtype: bool

In [38]:
raw_data = {
    '기수' : [40, 6, np.NaN],
    '학생수' : [20, 15, 8]
}

abc = DataFrame(data = raw_data, index = ['서울','광주','단기'])
abc
abc['가가'] = [1, 2, 3]
abc['나나'] = Series(data=[1, 2], index=['서울', '단기'])
abc

      기수  학생수  가가   나나
서울  40.0   20   1  1.0
광주   6.0   15   2  NaN
단기   NaN    8   3  2.0

In [37]:
data_scit1 = {
    '기수' : {'서울' : 40, '광주' : 6, '단기': np.nan},
    '학생수' : {'서울' : 20, '광주':15, '단기': 5}
}

df = DataFrame(data_scit1)
df

      기수  학생수
서울  40.0   20
광주   6.0   15
단기   NaN    5

In [53]:
#시계열 데이터
dates = pd.date_range('20210101', periods = 10)
df2 = DataFrame(np.random.randn(10, 4), index=dates, columns=['Kor', 'Jpn', 'Cha','Eng'])
df2

                 Kor       Jpn       Cha       Eng
2021-01-01  1.100062 -1.384169 -0.330721  0.029089
2021-01-02  1.063255  0.211823 -0.764170 -0.271949
2021-01-03  0.530065 -0.251899 -1.142233 -0.623350
2021-01-04  1.438187 -0.614754  1.091585 -0.531000
2021-01-05 -0.365168  0.119239 -1.509867  0.847616
2021-01-06 -0.092173 -0.444968 -1.029446 -1.256042
2021-01-07 -2.019308  1.194876 -1.417399  0.141550
2021-01-08 -0.142378  0.429482  0.765801  3.228655
2021-01-09  0.119323  1.442548 -0.430875  0.607520
2021-01-10 -1.126890  0.326870  0.642606  2.212894